---
kind: type
id: T:Autodesk.Revit.DB.DefinitionGroups
source: html/ff689646-266a-a62f-a044-8849697122c7.htm
---
# Autodesk.Revit.DB.DefinitionGroups

A specialized set of definition groups that allows creation of new groups.

## Syntax (C#)
```csharp
public class DefinitionGroups : IEnumerable<DefinitionGroup>,
	IDisposable
```